app/controllers/api/v1/books_controller.rb

        def index
          books = Book.all
---
SELECT "books".* FROM "books"

        def show
          book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        def create
          book = Book.new(book_params)
          if book.save
---
INSERT INTO "books" ("title", "author", "price", "published_on", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "New Book"], ["author", "John"], ["price", 199.0], ["published_on", nil], ["created_at", "2025-08-29 18:54:29.721057"], ["updated_at", "2025-08-29 18:54:29.721057"], ["category_id", 1]]