app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
    def set_book
      @book = Book.find(params.expect(:id))